openfoam-bridge/templates/cold-periodic-cascade/system/blockMeshDict
FoamFile {version 2.0; format ascii; class dictionary; object blockMeshDict;}

scale 1;
vertices ((-0.06 -0.03 -0.005) (0.10 -0.03 -0.005) (0.10 0.03 -0.005) (-0.06 0.03 -0.005)
          (-0.06 -0.03 0.005) (0.10 -0.03 0.005) (0.10 0.03 0.005) (-0.06 0.03 0.005));
blocks (hex (0 1 2 3 4 5 6 7) (80 30 5) simpleGrading (1 1 1)); edges ();
boundary (
 inlet {type patch; faces ((0 4 7 3));} outlet {type patch; faces ((1 2 6 5));}
 periodicLow {type cyclic; neighbourPatch periodicHigh; transform translational; separationVector (0 0.06 0); faces ((0 1 5 4));}
 periodicHigh {type cyclic; neighbourPatch periodicLow; transform translational; separationVector (0 -0.06 0); faces ((3 7 6 2));}
 spanLow {type symmetryPlane; faces ((0 3 2 1));} spanHigh {type symmetryPlane; faces ((4 5 6 7));}
); mergePatchPairs ();
