openfoam-bridge/templates/cold-periodic-cascade/0/alphat
FoamFile {version 2.0; format ascii; class volScalarField; object alphat;}
dimensions [1 -1 -1 0 0 0 0];
internalField uniform 0;
boundaryField { periodicLow {type cyclic;} periodicHigh {type cyclic;} spanLow {type symmetryPlane;} spanHigh {type symmetryPlane;} inlet {type calculated; value uniform 0;} outlet {type calculated; value uniform 0;} blade {type compressible::alphatWallFunction; Prt 0.85; value uniform 0;} }
